; domain
(define (domain COOK)
	(:requirements :strips :typing :adl)
	(:types ingredient)
	(:predicates (robot-at-foodstuff-station)
				 (robot-at-wash-station)
				 (robot-at-stove)
				 (in-tray ?x - ingredient)
				 (clean ?x - ingredient)
				 (holding ?x - ingredient)
				 (handempty)
				 (cooked ?x - ingredient)
				 (in-pile ?x - ingredient)
				 (on-stove ?x - ingredient)
				 (tray-in-hand)
	)

	(:action pick
			:parameters (?x - ingredient)
			:precondition (handempty)
			:effect
			(and (holding ?x)
				 (not (handempty))) 
	)
	(:action put-on-tray
			:parameters (?x - ingredient)
			:precondition (and (holding ?x) (not (in-tray ?x)))  
			:effect
			(and (in-tray ?x)
				 (not (in-pile ?x))
				 (not (on-stove ?x))
				 (not (holding ?x))
				 (handempty)
			)
	)

	(:action carry-tray
			:parameters (?x - ingredient)
			:precondition (and (not (tray-in-hand)) (handempty) (in-tray ?x))
			:effect (tray-in-hand)
	)

	(:action wash
			:parameters (?x - ingredient)
			:precondition (and (holding ?x) (in-tray ?x) (not (clean ?x)) (robot-at-wash-station))
			:effect (clean ?x) 
	)

	(:action go-to-wash-station
			:parameters ()
			:precondition (and (handempty) (not (robot-at-wash-station)) (tray-in-hand))
			:effect 
			(and (robot-at-wash-station)
				 (not (robot-at-foodstuff-station))
				 (not (robot-at-stove))
			)
	)

	(:action cook
			:parameters (?x - ingredient)
			:precondition (and (holding ?x) (in-tray ?x) (not (cooked ?x)) (robot-at-stove))
			:effect (cooked ?x)
	)

	(:action go-to-stove
			:parameters ()
			:precondition (and (handempty) (not (robot-at-stove)) (tray-in-hand))
			:effect
			(and (robot-at-stove)
				 (not (robot-at-wash-station))
				 (not (robot-at-foodstuff-station))
			)
	)
)

; problem
(define (problem ROBOT-COOK) 
(:domain COOK) 
 (:objects meat_can - ingredient)
(:init  (clean meat_can) (handempty)) 
(:goal (and  (cooked meat_can))))

; plan
1. (pick meat_can)
   deleted: (handempty)
   added: (holding meat_can)
   goals met: 0 of 1
2. (put-on-tray meat_can)
   deleted: (holding meat_can)
   added: (in-tray meat_can) (handempty)
   goals met: 0 of 1
3. (carry-tray meat_can)
   added: (tray-in-hand)
   goals met: 0 of 1
4. (go-to-stove)
   added: (robot-at-stove)
   goals met: 0 of 1
5. (pick meat_can)
   deleted: (handempty)
   added: (holding meat_can)
   goals met: 0 of 1
6. (cook meat_can)
   added: (cooked meat_can)
   goals met: 1 of 1
